// 链表：和数组类似是一个有序的线性结构，有仅有一个前驱，有且只有一个后继。
// 链表中的数据单位叫“节点”，节点在内存中的分布式离散的
// 链表中每个结点的结构都包含了两部分内容：1、数据域  2、指针域

// 链表和数组的使用
// 在添加或删除数据结构的时候，链表的新能更加高效，只需要改变目标节点及前驱/后继节点的指针，复杂度为O(1)
// 数组在改变一个元素（非尾部元素），后面的元素的位置都需要向后移动假设十足的长度是n，增加或者删除需要移动的元素量，就会随着数组的长度n的增大而增大，成一个线性关系，复杂度是O(n)

// 在查找元素的时候数组更加的高效，可以直接通过位置进行查找，复杂度为O(1)
// 链表只能从头部元素一个一个的向后面查找,复杂度为O(n)
// js中的数组: 如果是相同类型的元素，那么对应的确实是连续内存
const arr2 = [1, 2, 3, 4]
// 如果定义了不同类型的元素，它对应的就是一段非连续内存，此时js数组不在具有数组的特征，其底层使用哈希映射分配内存空间，是由对象链表来实现的
// 什么是真正的数组定义： 存储在连续内存空间里
const arr3 = ['qwe', 1, 2, 3]
